import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-tour',
  templateUrl: './tour.page.html',
  styleUrls: ['./tour.page.scss'],
})
export class TourPage implements OnInit {
  pagkage = [
    {thainame: 'ไร่เลย์ เบย์ รีสอร์ท แอนด์ สปา',
     englishname: 'Railay Bay Resort',
     detail: 'สะดวก รถ รับส่ง ส่วนตัว สนามบินกระบี่ - ท่าเรืออ่าวน้ำเมา พักรีสอร์ท ติดหาดติดหาดไร่เลย์ วิวสวย เช็คอิน ห้อง DELUXE COTTAGE 3 วัน 2 คืน พร้อม อาหารเช้า แบบบุฟเฟ่ต์ 2 มื้อ ชมบรรยากาศ หาดสวย พร้อมวิวอาทิตย์ลับขอบฟ้า',
     image: 'https://itp1.itopfile.com/ImageServer/itp_17012020ybvl/0/0/Home-Recommend-3z-z877547007295.jpg'} ,
     {thainame: 'เคซี แกรนด์ รีสอร์ท แอนด์ สปา',
     englishname: 'KC Grande Resort',
     detail: 'พักผ่อนติดเกาะ หย่อนใจ กับ รีสอร์ท์ติดทะเล " เคซี แกรนด์ รีสอร์ท แอนด์ สปา " ราคาโปรโมชั่น นี้ คุณจะได้พักที่ ห้องแบบ JACUZZI DELUXE 2 คืน พร้อมบริการอาหารเช้าแบบบุฟเฟ่ต์ จำนวน 2 มื้อ ชิลล์ ชมวิวทะเล สนุก ทริปล่องเรือเที่ยว 5 เกาะ พร้อมอาหารกลางวัน ประทับใจชมปะการังหลากสี ว่ายน้ำกับฝูงปลานับร้อย อุ่นใจ นั่งสบายบนเรือใหญ่ ไกด์และเจ้าหน้าที่คอยดูแล บริการ รถ รับส่ง จากท่าเรือบางเบ้า ไปส่งยัง ที่พัก โดยสวัสดิภาพ',
     image: 'https://itp1.itopfile.com/ImageServer/itp_17012020ybvl/1610/0/Home-Recommend-1z-z1094936940018.jpg'} ,
     {thainame: 'ทรายแก้ว บีช รีสอร์ท',
     englishname: 'Sai Keaw Beach Resort',
     detail: 'หย่อนใจ กับ รีสอร์ทติดหาดทรายแก้ว วิวสวย สงบและร่มรื่นบนเกาะเสม็ด " ทรายแก้ว บีช รีสอร์ท " ราคาโปรโมชั่น นี้ คุณจะได้พักที่ ห้องแบบ DELUXE ROOM 2 วัน 1 คืน พร้อมบริการอาหารเช้าแบบบุฟเฟ่ต์ จำนวน 1 มื้อ ชิลล์ชมวิวทะเล ฟังเสียงคลื่นตอนเช้า จิบชากาแฟ พักผ่อนได้เต็มที่ฟรี ! บริการ เรือข้ามเกาะเสม็ด ทั้งขาไป และขากลับ รถบริการ รับส่ง จากท่าเรือหน้าด่าน ถึง ที่พัก ทั้งขาไป และขากลับ',
     image: 'https://itp1.itopfile.com/ImageServer/itp_17012020ybvl/0/0/Home-Recommend-3z-z877547007295.jpg'} ,
     {thainame: 'โนโวเทล ระยอง ริมแพ รีสอร์ท',
     englishname: 'NovotelRayong Rimpae',
     detail: 'เช็คอิน รีสอร์ทติดหาดสวย " โนโวเทล ระยอง ริมแพ รีสอร์ท " เข้าพัก 2 วัน 1 คืน ที่ห้อง SUPERIOR ROOM อร่อย หลากหลาย อาหารเช้าแบบบุฟเฟต์ 1 มื้อ ชิลล์ชมวิวทะเล ฟังเสียงคลื่นตอนเช้า จิบชากาแฟ พักผ่อนได้เต็มที่ เอาใจ เจ้าตัวเล็ก กับ ห้องสำหรับเด็ก ไปเล่นของเล่นได้เลยสิทธิประโยชน์ ส่วนลด 30% สำหรับ สปา สิทธิประโยชน์ ส่วนลด 10% สำหรับ อาหารและเครื่องดื่ม',
     image: 'https://itp1.itopfile.com/ImageServer/itp_17012020ybvl/526/0/Novotel-19-5-65z-z257763485456.jpg'} ,
 ];
  constructor() { }

  ngOnInit() {
  }

}
